# LinkedResourcePathName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkedResourceOpenedEventArgs..::..LinkedResourcePathName Property
LinkedResourceOpenedEventArgs Class See Also
---
Path of the linked resource.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string LinkedResourcePathName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LinkedResourcePathName As String
	Get
```

Visual C++
---
```text
public:
property String^ LinkedResourcePathName {
	String^ get ();
}
```

# See Also
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace